customize_emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-05-20 Fri 00:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Customize Emacs</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="shaka" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Customize Emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Set values for predefined variables</a></li>
<li><a href="#orgheadline4">Bind shortcut keys</a>
<ul>
<li><a href="#orgheadline2">Set global shortcut key</a></li>
<li><a href="#orgheadline3">Set shortcut key for specific modes</a></li>
</ul>
</li>
<li><a href="#orgheadline5">Mode &amp; hook</a></li>
<li><a href="#orgheadline6">Third party extension</a></li>
</ul>
</div>
</div>
<p>
As is well-known, <a href="http://www.gnu.org/software/emacs">Emacs</a> is a powerful editor. Due to its infinite customizability and extensibility, in some sense, it is an operation system (OS) rather than an editor. This page briefly introduces how to customize it.
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Set values for predefined variables</h2>
<div class="outline-text-2" id="text-orgheadline1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq variable value)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4">Bind shortcut keys</h2>
<div class="outline-text-2" id="text-orgheadline4">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">Set global shortcut key</h3>
<div class="outline-text-3" id="text-orgheadline2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key key command)
</pre>
</div>
<p>
where <code>key</code> is shortcut<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>, e.g. <code>M-SPC</code>, <code>&lt;f7&gt;</code>, and <code>command</code> is the command name with a prefix of single quotation mark.
</p>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">Set shortcut key for specific modes</h3>
<div class="outline-text-3" id="text-orgheadline3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(define-key keymap key command)
</pre>
</div>
<p>
where <code>keymap</code> is associated to some mode, e.g. <code>c-mode-map</code>. Usually, each mode has its own keymap, which is the mode name appended with <code>-map</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">Mode &amp; hook</h2>
<div class="outline-text-2" id="text-orgheadline5">
<p>
Emacs uses different modes to provide different editing environment. Generally, each file type has its own <i>major-mode</i> <sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup> and one or more <i>minor-mode</i> <sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>. Usually, each major-mode provides <i>hook</i>, mode name appended with <code>-hook</code>. When entering some major-mode, the functions in the corresponding hook will be provoked.
</p>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6">Third party extension</h2>
<div class="outline-text-2" id="text-orgheadline6">
<p>
After the installation, the configuration includes two steps
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'load-path path-of-the-extension)
(require 'extension-name)
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
The expressions of the shortcut key can be obtained by <code>C-h k</code> first and then treated as the input parameter of <code>kbd</code>, e.g. <code>(kbd "M-SPC")</code>.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
For the file type, define syntax highlight, indent, comment, etc.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
It can be aded to <code>major-mode</code>. It defines the enhancement or decoration.
</p></div></div>


</div>
</div></div>
</body>
</html>
